In [158]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_absolute_error

In [159]:
url = 'Salary Data.csv'
df = pd.read_csv(url, sep=",")
df.describe()

              Age  Years of Experience         Salary
count  373.000000           373.000000     373.000000
mean    37.431635            10.030831  100577.345845
std      7.069073             6.557007   48240.013482
min     23.000000             0.000000     350.000000
25%     31.000000             4.000000   55000.000000
50%     36.000000             9.000000   95000.000000
75%     44.000000            15.000000  140000.000000
max     53.000000            25.000000  250000.000000

In [160]:
df.head(10)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0
6,42.0,Female,Master's,Product Manager,12.0,120000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
8,26.0,Female,Bachelor's,Marketing Coordinator,1.0,45000.0
9,38.0,Male,PhD,Senior Scientist,10.0,110000.0

In [161]:
le = LabelEncoder()
df.Gender=le.fit_transform(df.Gender)
df['Job Title']=le.fit_transform(df['Job Title'])

In [162]:
df.dropna(subset=['Education Level'], inplace=True)  
df = df.replace([np.inf, -np.inf], np.nan).dropna(subset=['Education Level'], how="all")

In [163]:
education_mapping = {
    "Bachelor's": 1,
    "Master's": 2,
    "PhD": 3
}
df['Education Level'] = df['Education Level'].map(education_mapping).astype('int32')

In [164]:
df.head(10)

    Age  Gender  Education Level  Job Title  Years of Experience    Salary
0  32.0       1                1        159                  5.0   90000.0
1  28.0       0                2         17                  3.0   65000.0
2  45.0       1                3        130                 15.0  150000.0
3  36.0       0                1        101                  7.0   60000.0
4  52.0       1                2         22                 20.0  200000.0
5  29.0       1                1         81                  2.0   55000.0
6  42.0       0                2         93                 12.0  120000.0
7  31.0       1                1        104                  4.0   80000.0
8  26.0       0                1         82                  1.0   45000.0
9  38.0       1                3        150                 10.0  110000.0

In [165]:
X = df.drop(columns=['Salary']) 
y = df['Salary']  
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

print("Rozmiar zbioru treningowego:", len(X_train))
print("Rozmiar zbioru testowego:", len(X_test))

Rozmiar zbioru treningowego: 261
Rozmiar zbioru testowego: 112

In [166]:
model = LinearRegression()

model.fit(X_train, y_train)

y_predicted = model.predict(X_test)

mae = mean_absolute_error(y_test, y_predicted)
print("Błąd średni absolutny:", mae)

Błąd: 11377.183126703088

1. Zmiana etykiety
2. Podzial na testowy i treningowy (30% i 70%)